#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.paks: Refreshing state... [id=7ea918c8625b11855469cff5187799d4c893fca4]
azurerm_resource_group.aks: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks]
azurerm_public_ip.vm: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/publicIPAddresses/jump-box-pip]
azurerm_virtual_network.aksvnet: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet]
azurerm_network_security_group.aks_nsg: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg]
azurerm_subnet.aksnodesub: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/aksnodesub]
azurerm_subnet.akscontrolsub: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/akscontrolsub]
module.paks.azurerm_network_security_rule.aks["deny_tcp_10250_inbound"]: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg/securityRules/deny_tcp_10250_inbound]
module.paks.azurerm_network_security_rule.aks["deny_tcp_10255_inbound"]: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg/securityRules/deny_tcp_10255_inbound]
azurerm_network_interface.vm: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkInterfaces/example-nic]
module.paks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourcegroups/aks/providers/Microsoft.ContainerService/managedClusters/private-aks-westus-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westus"
      + max_bid_price                   = -1
      + name                            = "jump-box"
      + network_interface_ids           = [
          + "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkInterfaces/example-nic",
        ]
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "aks"
      + size                            = "Standard_B1LS"
      + tags                            = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDC8i0X7VyK4ZiGNeyqKKWaGIjYKXz8EFVfSPOgS9yV0Jd8Tdtd00XyCPZVi5gpF8ofLiXHClEu990hAb3qwhH0IcjB+SrDSUnSp1mM4HKvepeXbHLRDTB0kBDhaI81/XqzRKDu/Gnh3db2KqTaO2zeFkXI30dCIOf41QT+3Mqz87LKJy6a5PVnX8BuRomZUPdVKJ+WnoGCMTlgCqxPDkKIzLQ8lREjTEOlby2hZKit7u/q+EVNXmOY7sAqwLgTo9Umk2GcfP5JQAOUOvpu9PlEFX+Z7wXN3Vs9N9Mt1IxE+sUswKOYGS4I1He3Z7SAQiWWqefQ+Cse+ogeDHF3YDbaXet6xnnjSG3kYBc5GD3U3Q5LEtAX31Exxp9vCgiPVtFVAYQzXHwYL3IOwtCGl0XsMfpj20Hrb/Yye7t4BRFxDAFk36H5nuldQ4g360LGE70ji7wmB/Jr+IXXEl2Spxat0uWJC9dh30Y4Q2ywfIUUVHQDcVleG0WO5l/4/aWJZc+u5QUwk42B4Kec/EOk7ewnE8Ce9/us/7uXRA/upaLAlaoj4Nipws7tPKMhFuA8TviGQgyx1GR+OtnaaEcbT3pVz7A4qg1fe2l0lL/W9ubb4Ao+AMNMm0Ao7liZw+zan/yW2+GHKvlQ6J0aOAXArJZ/SIxYawZj0YA9RzJsechRHw==
            EOT
          + username   = "thevitch"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen1"
          + version   = "latest"
        }
    }

  # null_resource.cluster will be created
  + resource "null_resource" "cluster" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*